20260119231941-sales_growth_meeting_6th.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-03-11 Wed 03:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>sales growth meeting 6th</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">sales growth meeting 6th</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgfcc6f49">Growth Meeting #6: Psychology of Influence (30 mins)</a>
<ul>
<li><a href="#org6eb6d41">INTRO (2 mins) ⏱️</a></li>
</ul>
</li>
<li><a href="#orgc8f8146">SECTION 1: RECIPROCITY - The Mints (10 mins)</a>
<ul>
<li><a href="#orgf3df89a">The Story (1 min) 🍬</a></li>
<li><a href="#orge232b5a">HMC Sales Example (9 mins) 💪</a>
<ul>
<li><a href="#orgf9085d0">Situation</a></li>
<li><a href="#org395c3ec">Step 1: First Mint - FREE Audit (Day 1-2)</a></li>
<li><a href="#org5c6ed31">Step 2: Second Mint - Personal Custom Plan (Day 3)</a></li>
<li><a href="#orgec7c35d">Step 3: Close (Day 4)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org446b47b">SECTION 2: COMMITMENT - The Buttons (10 mins)</a>
<ul>
<li><a href="#org12138e3">The Story (1 min) 🔘</a></li>
<li><a href="#org9e9c50b">HMC Sales Example (9 mins) 💪</a>
<ul>
<li><a href="#org72ed3b0">Situation</a></li>
<li><a href="#org5adb21f">Button #1: 5-min Problem Quiz (Day 1)</a></li>
<li><a href="#org5bf6a56">Button #2: 15-min HMC Demo (Day 2)</a></li>
<li><a href="#org802f724">Button #3: Site Visit (Day 3)</a></li>
<li><a href="#orga31b24b">Button #4: Advance Payment (Day 4)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgbc546b0">SECTION 3: SCARCITY - The Urgency (6 mins)</a>
<ul>
<li><a href="#org93f8d61">The Story (1 min) 💎</a></li>
<li><a href="#org3525ac9">HMC Sales Example (5 mins) 💪</a>
<ul>
<li><a href="#org89a02bc">Situation</a></li>
<li><a href="#orgfb9101d">Step 1: Clarify Real Scarcity</a></li>
<li><a href="#orgb72737c">Step 2: Add Competition</a></li>
<li><a href="#orga509087">Step 3: Add Deadline</a></li>
<li><a href="#org04e93ed">Step 4: Firm Pricing (No Desperation)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4c651db">CONCLUSION (2 mins) 🎯</a>
<ul>
<li><a href="#orgd09ff86">The Magic Formula</a></li>
<li><a href="#org4eb2def">This Week's Action (Pick 1 Machine)</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgfcc6f49" class="outline-2">
<h2 id="orgfcc6f49">Growth Meeting #6: Psychology of Influence (30 mins)</h2>
<div class="outline-text-2" id="text-orgfcc6f49">
</div>

<div id="outline-container-org6eb6d41" class="outline-3">
<h3 id="org6eb6d41">INTRO (2 mins) ⏱️</h3>
<div class="outline-text-3" id="text-org6eb6d41">
<p>
Three psychological principles that close JHAT PAT deals:
</p>
<ul class="org-ul">
<li>Reciprocity: Give first → Buyer reciprocates</li>
<li>Commitment: Stack small yeses → Buyer locked in</li>
<li>Scarcity: Limited time → Buyer acts NOW</li>
</ul>

<p>
तीनों को combine करो = Deal done!
</p>

<p>
&#x2014;
</p>
</div>
</div>
</div>

<div id="outline-container-orgc8f8146" class="outline-2">
<h2 id="orgc8f8146">SECTION 1: RECIPROCITY - The Mints (10 mins)</h2>
<div class="outline-text-2" id="text-orgc8f8146">
</div>

<div id="outline-container-orgf3df89a" class="outline-3">
<h3 id="orgf3df89a">The Story (1 min) 🍬</h3>
<div class="outline-text-3" id="text-orgf3df89a">
<p>
Restaurant waiter:
</p>
<ul class="org-ul">
<li>First mint with bill → 3% tip increase</li>
<li>Second mint personally + "you're nice folks" → 23% tips! 📈</li>
</ul>

<p>
Why? People reciprocate gifts. It's natural human behavior.
</p>

<p>
&#x2014;
</p>
</div>
</div>

<div id="outline-container-orge232b5a" class="outline-3">
<h3 id="orge232b5a">HMC Sales Example (9 mins) 💪</h3>
<div class="outline-text-3" id="text-orge232b5a">
</div>
<div id="outline-container-orgf9085d0" class="outline-4">
<h4 id="orgf9085d0">Situation</h4>
<div class="outline-text-4" id="text-orgf9085d0">
<ul class="org-ul">
<li>Product: Used HMC, 2018 model</li>
<li>Buyer: "Cash tight, future में देखेंगे"</li>
<li>Your goal: Convert "maybe" → "advance today"</li>
</ul>
</div>
</div>

<div id="outline-container-org395c3ec" class="outline-4">
<h4 id="org395c3ec">Step 1: First Mint - FREE Audit (Day 1-2)</h4>
<div class="outline-text-4" id="text-org395c3ec">
<p>
You call:
</p>

<blockquote>
<p>
भैया, तुम्हारा current production setup का free audit दे दूँ?
Spindle hours, changeover time, idle time – सब निकालूँ।
30 mins, कोई charge नहीं।
</p>
</blockquote>

<p>
What happens:
</p>
<ul class="org-ul">
<li>You study their 3-4 parts on current VMC</li>
<li>You calculate actual cycle times</li>
<li>You make rough ROI comparison: Old VMC vs New HMC</li>
</ul>
</div>
</div>

<div id="outline-container-org5c6ed31" class="outline-4">
<h4 id="org5c6ed31">Step 2: Second Mint - Personal Custom Plan (Day 3)</h4>
<div class="outline-text-4" id="text-org5c6ed31">
<p>
After audit, you say:
</p>

<blockquote>
<p>
देख, तुम serious काम कर रहे हो।
तेरे 3 jobs को HMC पर shift करूँ तो:
</p>
<ul class="org-ul">
<li>Setup time 40% कम</li>
<li>Production capacity 20-25% extra</li>
<li>हर महीने ₹2-3L बचत</li>
</ul>

<p>
मैं तेरे drawings के लिए custom calculation किया है।
सिर्फ तेरे लिए, generic नहीं।
</p>
</blockquote>

<p>
What buyer thinks:
</p>
<ul class="org-ul">
<li>"इन्होंने free में मेरा audit किया"</li>
<li>"मेरे exact parts पर calculation किया"</li>
<li>"मैं special हूँ, not just another lead"</li>
</ul>
</div>
</div>

<div id="outline-container-orgec7c35d" class="outline-4">
<h4 id="orgec7c35d">Step 3: Close (Day 4)</h4>
<div class="outline-text-4" id="text-orgec7c35d">
<p>
You say:
</p>

<blockquote>
<p>
तो एक छोटा step ले –
2 लाख का token दे।
HMC मैं तेरे नाम 15 दिन hold कर दूँ।
नहीं लिया तो token adjust करके दूसरे machine में दूँगा।
</p>
</blockquote>

<p>
Result: Advance ✅
</p>

<p>
Why it worked:
</p>
<ul class="org-ul">
<li>You GAVE first (time, analysis, custom plan)</li>
<li>Buyer FELT indebted</li>
<li>Small token (2L) feels reasonable return for your investment</li>
</ul>

<p>
&#x2014;
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org446b47b" class="outline-2">
<h2 id="org446b47b">SECTION 2: COMMITMENT - The Buttons (10 mins)</h2>
<div class="outline-text-2" id="text-org446b47b">
</div>

<div id="outline-container-org12138e3" class="outline-3">
<h3 id="org12138e3">The Story (1 min) 🔘</h3>
<div class="outline-text-3" id="text-org12138e3">
<p>
Researchers gave people "I Will Help Cancer" button.
They wore it casually, thought nothing.
</p>

<p>
Later: Asked to volunteer.
Result: 700% more volunteering + donations! 📈
</p>

<p>
Why? Once they said "Yes" to button, they saw themselves as helpers.
Future actions aligned with new identity.
</p>

<p>
&#x2014;
</p>
</div>
</div>

<div id="outline-container-org9e9c50b" class="outline-3">
<h3 id="org9e9c50b">HMC Sales Example (9 mins) 💪</h3>
<div class="outline-text-3" id="text-org9e9c50b">
</div>
<div id="outline-container-org72ed3b0" class="outline-4">
<h4 id="org72ed3b0">Situation</h4>
<div class="outline-text-4" id="text-org72ed3b0">
<ul class="org-ul">
<li>Product: Used HMC, 400mm pallet</li>
<li>Buyer: "Soch ke bataaunga" (delaying forever)</li>
<li>Your goal: Convert delay → commitment → deal</li>
</ul>
</div>
</div>

<div id="outline-container-org5adb21f" class="outline-4">
<h4 id="org5adb21f">Button #1: 5-min Problem Quiz (Day 1)</h4>
<div class="outline-text-4" id="text-org5adb21f">
<p>
You call:
</p>

<blockquote>
<p>
एक 5-min quiz करूँ?
Biggest pain right now – delivery delay, rework, या setup time?
</p>
</blockquote>

<p>
Buyer says YES (first commitment).
He answers 4-5 quick questions.
</p>

<p>
Identity shift: "मैं serious हूँ, अपनी problems solve करना चाहता हूँ"
</p>
</div>
</div>

<div id="outline-container-org5bf6a56" class="outline-4">
<h4 id="org5bf6a56">Button #2: 15-min HMC Demo (Day 2)</h4>
<div class="outline-text-4" id="text-org5bf6a56">
<p>
You send video/WhatsApp:
</p>

<blockquote>
<p>
तुम्हारे answers से लगता है HMC से
जो 3 shifts में करते हो, वो 2 में कर सकते हो।
15-min demo देखोगे?
</p>
</blockquote>

<p>
Buyer says YES (second commitment).
He invests time watching.
</p>

<p>
Identity shift: "मैं HMC seriously evaluate कर रहा हूँ"
</p>
</div>
</div>

<div id="outline-container-org802f724" class="outline-4">
<h4 id="org802f724">Button #3: Site Visit (Day 3)</h4>
<div class="outline-text-4" id="text-org802f724">
<p>
You call:
</p>

<blockquote>
<p>
Demo अच्छा लगा न?
Friday 3 PM को warehouse में live machine चलाकर दिखाऊँ?
</p>
</blockquote>

<p>
Buyer says YES (third commitment).
He blocks calendar.
</p>

<p>
Identity shift: "मैं buyer हूँ, not just browser"
</p>
</div>
</div>

<div id="outline-container-orga31b24b" class="outline-4">
<h4 id="orga31b24b">Button #4: Advance Payment (Day 4)</h4>
<div class="outline-text-4" id="text-orga31b24b">
<p>
At warehouse, end of visit:
</p>

<blockquote>
<p>
देख, तूने:
</p>
<ul class="org-ul">
<li>अपनी problems share की</li>
<li>Demo देखा</li>
<li>Machine physically देख लिया</li>
</ul>

<p>
एक छोटा step ले – 2L token दे।
HMC मैं तेरे नाम 15 दिन hold कर दूँ।
</p>
</blockquote>

<p>
Buyer thinks:
</p>

<blockquote>
<p>
मैं यहाँ तक आ गया।
Backing out का मतलब मैं fake हूँ।
Advance दे ही दूँ।
</p>
</blockquote>

<p>
Result: Advance ✅
</p>

<p>
Why it worked:
</p>
<ul class="org-ul">
<li>Each "Yes" is small (5 mins, 15 mins, 1 hour)</li>
<li>Each "Yes" = public commitment (he told you yes)</li>
<li>By Button #4, he's psychologically locked as "serious buyer"</li>
<li>Can't back out without losing face</li>
</ul>

<p>
&#x2014;
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgbc546b0" class="outline-2">
<h2 id="orgbc546b0">SECTION 3: SCARCITY - The Urgency (6 mins)</h2>
<div class="outline-text-2" id="text-orgbc546b0">
</div>

<div id="outline-container-org93f8d61" class="outline-3">
<h3 id="org93f8d61">The Story (1 min) 💎</h3>
<div class="outline-text-3" id="text-org93f8d61">
<p>
Jewelry shop: Turquoise not selling.
Manager accidentally doubles price (125 → 250).
INSTANT SOLD OUT! 📈
</p>

<p>
Why? Higher price = perceived quality.
Limited stock + high price = MUST BUY NOW (FOMO).
</p>

<p>
&#x2014;
</p>
</div>
</div>

<div id="outline-container-org3525ac9" class="outline-3">
<h3 id="org3525ac9">HMC Sales Example (5 mins) 💪</h3>
<div class="outline-text-3" id="text-org3525ac9">
</div>
<div id="outline-container-org89a02bc" class="outline-4">
<h4 id="org89a02bc">Situation</h4>
<div class="outline-text-4" id="text-org89a02bc">
<ul class="org-ul">
<li>Product: Only 1 used HMC available, low hours</li>
<li>Buyer: Saw machine once, still delaying</li>
<li>Your goal: Create urgency → advance today</li>
</ul>
</div>
</div>

<div id="outline-container-orgfb9101d" class="outline-4">
<h4 id="orgfb9101d">Step 1: Clarify Real Scarcity</h4>
<div class="outline-text-4" id="text-orgfb9101d">
<p>
You say (Day 1):
</p>

<blockquote>
<p>
सुन, ये HMC जैसी condition में साल में 1-2 बार ही मिलती है।
Hours कम हैं, condition clean है।
मेरे पास सिर्फ यही 1 piece है।
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orgb72737c" class="outline-4">
<h4 id="orgb72737c">Step 2: Add Competition</h4>
<div class="outline-text-4" id="text-orgb72737c">
<p>
You say (Day 2):
</p>

<blockquote>
<p>
देख, दो और लोग हैं जो रोज़ update पूछ रहे हैं।
मैं अभी तक तेरे लिए hold करके बैठा हूँ।
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orga509087" class="outline-4">
<h4 id="orga509087">Step 3: Add Deadline</h4>
<div class="outline-text-4" id="text-orga509087">
<p>
You say (Day 3):
</p>

<blockquote>
<p>
आज शाम तक तू confirm कर।
नहीं तो कल morning से दूसरे को priority दूँगा।
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org04e93ed" class="outline-4">
<h4 id="org04e93ed">Step 4: Firm Pricing (No Desperation)</h4>
<div class="outline-text-4" id="text-org04e93ed">
<p>
You say (Day 3):
</p>

<blockquote>
<p>
15.5 से कम नहीं करूँगा।
नए में 19+ जाएगा।
Condition rare है, deal genuine है।
Nahi लेना, कोई problem नहीं।
</p>
</blockquote>

<p>
Buyer's mind:
</p>
<ul class="org-ul">
<li>"सिर्फ 1 ही है" ✅ Scarcity</li>
<li>"दूसरे buyers भी हैं" ✅ Competition</li>
<li>"आज ही decide करना" ✅ Urgency</li>
<li>"He's not desperate" ✅ Confidence = quality signal</li>
</ul>

<p>
Result: "2L advance करता हूँ, HMC hold कर दे!" ✅
</p>

<p>
Why it worked:
</p>
<ul class="org-ul">
<li>Real scarcity (actually 1 machine)</li>
<li>Real competition (actually multiple inquiries)</li>
<li>Real deadline (actually moving to next buyer)</li>
<li>Confident pricing = this is NOT desperate seller</li>
</ul>

<p>
&#x2014;
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org4c651db" class="outline-2">
<h2 id="org4c651db">CONCLUSION (2 mins) 🎯</h2>
<div class="outline-text-2" id="text-org4c651db">
</div>
<div id="outline-container-orgd09ff86" class="outline-3">
<h3 id="orgd09ff86">The Magic Formula</h3>
<div class="outline-text-3" id="text-orgd09ff86">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Principle</th>
<th scope="col" class="org-left">What Buyer Thinks</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Reciprocity</td>
<td class="org-left">"वह invest कर रहे हैं, मुझे भी करना चाहिए"</td>
</tr>

<tr>
<td class="org-left">Commitment</td>
<td class="org-left">"मैं यहाँ तक आ गया, backing out awkward है"</td>
</tr>

<tr>
<td class="org-left">Scarcity</td>
<td class="org-left">"अब या कभी नहीं"</td>
</tr>
</tbody>
</table>

<p>
तीनों को combine करो = JHAT PAT DEAL DONE!
</p>

<p>
&#x2014;
</p>
</div>
</div>

<div id="outline-container-org4eb2def" class="outline-3">
<h3 id="org4eb2def">This Week's Action (Pick 1 Machine)</h3>
<div class="outline-text-3" id="text-org4eb2def">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Day</th>
<th scope="col" class="org-left">Action</th>
<th scope="col" class="org-left">Principle</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1-2</td>
<td class="org-left">Free audit</td>
<td class="org-left">Reciprocity Mint</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">Custom proposal</td>
<td class="org-left">Reciprocity Trigger</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">Quiz</td>
<td class="org-left">Commitment Button #1</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">Demo</td>
<td class="org-left">Commitment Button #2</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">Site visit</td>
<td class="org-left">Commitment Button #3</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">Scarcity pressure + Advance</td>
<td class="org-left">Button #4 + FOMO</td>
</tr>
</tbody>
</table>

<p>
Result Target: Advance payment locked ✅
</p>

<p>
&#x2014;
</p>

<p>
:JHAT PAT PATAPAT - डील खिशे में!:
</p>
</div>
</div>
</div>
</div>
</body>
</html>